export const rowsPerPageOptions: number[]    = [4, 6, 8, 10, 12, 14, 15, 18, 20, 30, 50, 100, 200, 300, 400, 500, 1000, 5000];
export const uaLocale                        = {
    firstDayOfWeek  : 1,
    dayNames        : ["неділя", "понеділок", "вівторок", "середа", "четвер", "п'ятниця", "субота"],
    dayNamesShort   : ["Нед", "Пон", "Вівт", "Сер", "Чет", "П'ят", "Суб"],
    dayNamesMin     : ["Нд", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"],
    monthNames      : ["січень", "лютий", "березень", "квітень", "травень", "червень", "липень", "серпень", "вересень", "жовтень", "листопад", "грудень"],
    monthNamesRV    : ["січня", "лютого", "березня", "квітня", "травня", "червня", "липня", "серпня", "вересня", "жовтня", "листопада", "грудня"],
    monthNamesDV    : ["січні", "лютому", "березні", "квітні", "травні", "червні", "липні", "серпні", "вересні", "жовтні", "листопаді", "грудні"],
    monthNamesShort : ["січ", "лют", "бер", "квіт", "трав", "черв", "лип", "серп", "вер", "жовт", "лист", "груд"],
    today           : "Сьогодні",
    clear           : "Очистити"
};
export const maxCountRowsForScroll           = 500;
export const pageLinks                       = 5;
export const yearRange                       = "1910:2079";
